In [1]:
import pandas as pd
data = {'name':['suraj','kaju','dugu'],'age':[22,21,20]}
df = pd.DataFrame(data)

In [2]:
df

    name  age
0  suraj   22
1   kaju   21
2   dugu   20

In [3]:
df.corr()

     age
age  1.0

In [28]:
data1 = {
    'name':['suraj','dugu','jappati'],
    'height':[5.3,8.6,4.5],
    'dept':['ai','comp','mech']
}

In [29]:
import pandas as pd

In [30]:
df = pd.DataFrame(data1)

In [31]:
df

      name  height  dept
0    suraj     5.3    ai
1     dugu     8.6  comp
2  jappati     4.5  mech

In [32]:
df.insert(1,'age',[22,20,20])
df

      name  age  height  dept
0    suraj   22     5.3    ai
1     dugu   20     8.6  comp
2  jappati   20     4.5  mech